export const FILTER_DATA = {
    disasterArea: {
      type: 'radio',
      label: 'พื้นที่เกิดภัย',
      data: [
        "วันนี้",
        "คาดการณ์ 1 วัน",
        "คาดการณ์ 2 วัน",
        "คาดการณ์ 3 วัน",
        "คาดการณ์ 5 วัน",
        "พื้นที่ที่ได้รับความเสียหาย"
      ]
    },
    "disasterFactors": {
      type: 'switch',
      label: 'ปัจจัยการเกิดภัย',
      data: [
        "ปริมาณน้ำฝน",
        "ปริมาณน้ำเขื่อน",
        "ปริมาณน้ำท่า",
        "ความชื้นดิน"
      ]
    },
    "populationData": {
      type: 'switch',
      label: 'ข้อมูลประชากร',
      data: [
        "ประชาชน",
        "ครัวเรือน"
      ]
    },
    "importentPlace": {
      type: 'switch',
      label: 'สถานที่สําคัญ',
      data: [
        "ศูนย์พักพิง",
        "พื้นที่การเกษตร",
        "สำนักงานเขต ปภ.",
        "ปภ. จังหวัด",
        "เสาวิทยุสื่อสาร",
        "หน่วยงานราชการ",
        "โรงเรียน",
        "โรงพยาบาล",
        "สถานบริการน้ำมัน"
      ]
    },
    "resources": {
      type: 'switch',
      label: 'ทรัพยากร',
      data: [
        "รถปฏิบัติการ",
        "รถบรรทุก",
        "เรือปฏิบัติการ",
        "เครื่องสูบน้ำ",
        "การช่วยเหลือทางการเกษตร",
        "เครื่องมือปฏิบัติการอื่นๆ"
      ]
    }
  };
